export default {
    locale: 'ru',
    country: 'RU',
    loginPanel: {
        validateTip: 'Код верификации',
        accountLogin: 'Пароль учетной записи Логин',
        phoneLogin: 'Номер мобильного телефона Войти',
        accountPhd: 'Пожалуйста, введите свой номер мобильного телефона / учетной записи',
        passwordPhd: 'Пожалуйста, введите пароль',
        validateCodePhd: 'Пожалуйста, введите проверку код',
        loginBtn: 'Авторизоваться',
        autoLogin: 'Автоматический вход',
        forgetPwd: 'Забыл пароль',
        accountReq: 'Номер мобильного телефона / учетная запись не может быть пустой',
        passwordReq: 'Пароль не может быть пустым',
        validateCodeReq: 'Код подтверждения должен быть заполнен'
    },
    menuObj: {
        homePage: 'титульная страница',
        'menu-0': 'Основные функции',
        'menu-1': 'Компонент использует',
        'menu-0-0': 'Технический выбор',
        'menu-0-0-0': 'Vue3.x.',
        'menu-0-0-1': 'Наивеуи',
        'menu-0-0-2': 'Pinia.',
        'menu-0-0-3': 'Близко',
        'menu-1-0': 'Встроенный компонент',
        'menu-1-0-0': 'Панель поиска',
        'menu-1-0-1': 'Общая форма',
        'menu-0-1': 'Функция рамки',
        'menu-0-1-0': 'Компонент страницы',
        'menu-0-1-0-0': 'Компонентная страница',
        'menu-0-1-0-1': 'Страница URL',
        'menu-0-1-1': 'Встроенная функция',
        'menu-0-1-1-0': 'Конфигурация проекта',
        'menu-0-1-1-1': 'глобализация'
    },
    localeMap: {
        ar: 'арабский',
        bg: 'болгарский',
        ca: 'Каталония',
        cs: 'Чешский',
        da: 'Датский',
        de: 'Немецкий',
        el: 'Греческий',
        'en-gb': 'английский',
        en: 'английский',
        es: 'испанский язык',
        et: 'эстонский',
        fa: 'Персидский',
        fi: 'Финский',
        fr: 'Французский',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хорватский',
        hu: 'венгерский язык',
        hy: 'Армянский язык',
        id: 'индонезийский язык',
        is: 'Исландский язык',
        it: 'Итальянский',
        ja: 'японский язык',
        kn: 'Канада',
        ko: 'корейский язык',
        'ku-iq': 'Центральный курд',
        lv: 'Центральный курд',
        mk: 'македонский',
        'mn-mn': 'Монгольский язык',
        'ms-my': 'малайский',
        nb: 'Норвежский язык',
        'ne-np': 'Непальский',
        'nl-be': 'Язык Флана',
        nl: 'нидерландский язык',
        pl: 'Польский',
        'pt-br': 'бразильский португальский',
        pt: 'Европа португальский',
        ro: 'румынский',
        ru: 'русский язык',
        sk: 'словацкий',
        sl: 'словенский',
        sr: 'сербский',
        sv: 'Шведский язык',
        ta: 'Тамил',
        th: 'Тайский',
        tr: 'турецкий',
        uk: 'украинец',
        vi: 'вьетнамский',
        'zh-cn': 'Упрощенный китайский',
        'zh-tw': 'традиционный китайский'
    },
    sysInfo: {
        description: 'Деревянная основа на основе нейтральной разработки на основе VUE3 и Naiveui'
    },
    validateButton: {
        unableValidate: 'Номер мобильного телефона пустой или не соответствует правилам',
        getValidateCode: 'Получить код подтверждения'
    },
    tagObj: {
        closeAll: 'Закрыть все этикетки',
        closeCur: 'Закройте текущий ярлык',
        closeOther: 'Закройте другие этикетки',
        closeRight: 'Закрыть правильный ярлык',
        singlePage: 'Автономная страница',
        refreshPage: 'Обновить страницу',
        affixPage: 'Исправлена ​​страница',
        cancelAffixPage: 'Отменить фиксацию',
        errorTip: {
            homePageCloseError: 'Дом не допускается закрыть',
            affixPageCloseError: 'Фиксированная страница не разрешена закрывать',
            homePageAffixError: 'Дом не может быть отменен'
        },
        checkSave: 'Вы закрываете страницу? (Пожалуйста, убедитесь, что контент страницы красных меток был сохранен)',
        cancelClose: 'Закрытая операция'
    },
    modalObj: {
        tip: 'намекать',
        warn: 'предупреждать',
        confirm: 'подтверждать',
        yes: 'да',
        no: 'нет'
    },
    userPanel: {
        frontendLog: 'Фронт-концевой журнал',
        customSetting: 'Персонализированная настройка',
        cleanConfig: 'Очистить конфигурацию',
        cleanCache: 'очистить кэш'
    },
    searchPanel: {
        expandText: 'Развернуться',
        collapseText: 'Убрать',
        resetText: 'Сброс настроек',
        searchText: 'Запрашивать'
    },
    comTip: {
        notFoundModule: 'Не могу найти модуль:'
    },
    logLine: {
        timeArea: 'лимит времени',
        tableTitle: 'Список журналов',
        tableColumn: {
            index: 'Серийный номер',
            desc: 'Описание журнала',
            type: 'Тип журнала',
            time: 'время',
            op: 'действовать'
        }
    },
    logTimeList: {
        halfDay: 'Пол дня',
        fullDay: 'В течение одного дня',
        weekDay: 'в течении недели',
        monthDay: 'В течении месяца'
    }
}
