export default {
    locale: 'ru',
    country: 'RU',
    loginPanel: {
        validateTip: 'Проверочный код',
        accountLogin: 'Пароль учетной записи Логин',
        phoneLogin: 'Номер мобильного телефона Войти',
        accountPhd: 'Пожалуйста, введите свой номер мобильного телефона / учетной записи',
        passwordPhd: 'Пожалуйста, введите пароль',
        validateCodePhd: 'Пожалуйста, введите проверку код',
        loginBtn: 'Авторизоваться',
        autoLogin: 'автоматическая авторизация',
        forgetPwd: 'Забыли пароль',
        accountReq: 'Номер мобильного телефона / учетная запись не может быть пустой',
        passwordReq: 'Пароль не может быть пустым',
        validateCodeReq: 'Код подтверждения должен быть заполнен'
    },
    menuObj: {
        homePage: 'титульная страница',
        'menu-0': 'Основная функция',
        'menu-1': 'Компонент использует',
        'menu-0-0': 'Технический выбор',
        'menu-0-0-0': 'Vue3.x.',
        'menu-0-0-1': 'Наивеуи',
        'menu-0-0-2': 'Pinia.',
        'menu-0-0-3': 'Близко',
        'menu-1-0': 'Встроенный компонент',
        'menu-1-0-0': 'Панель поиска',
        'menu-1-0-1': 'Общая форма',
        'menu-0-1': 'Функция рамки',
        'menu-0-1-0': 'Компонент страницы',
        'menu-0-1-0-0': 'Компонентная страница',
        'menu-0-1-0-1': 'Страница URL',
        'menu-0-1-1': 'Встроенная функция',
        'menu-0-1-1-0': 'Конфигурация проекта',
        'menu-0-1-1-1': 'глобализация'
    },
    localeMap: {
        ar: 'арабский',
        bg: 'болгарский',
        ca: 'Каталония',
        cs: 'Чешский',
        da: 'Датский',
        de: 'Немецкий',
        el: 'Греческий',
        'en-gb': 'Английский',
        en: 'Английский',
        es: 'испанский',
        et: 'эстонский',
        fa: 'Персидский',
        fi: 'Финский',
        fr: 'Французский',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хорватский',
        hu: 'венгерский язык',
        hy: 'Армянский язык',
        id: 'индонезийский язык',
        is: 'Исландский язык',
        it: 'Итальянский',
        ja: 'Японский',
        kn: 'Канада',
        ko: 'Корейский',
        'ku-iq': 'Центральный курд',
        lv: 'Центральный курд',
        mk: 'македонский',
        'mn-mn': 'Монгольский язык',
        'ms-my': 'малайский',
        nb: 'Норвежский язык',
        'ne-np': 'Непальский',
        'nl-be': 'Язык Флана',
        nl: 'Голландский',
        pl: 'Польский',
        'pt-br': 'бразильский португальский',
        pt: 'Европа португальский',
        ro: 'румынский',
        ru: 'русский язык',
        sk: 'словацкий',
        sl: 'словенский',
        sr: 'сербский',
        sv: 'Шведский язык',
        ta: 'Тамил',
        th: 'Тайский',
        tr: 'турецкий',
        uk: 'украинец',
        vi: 'вьетнамский',
        'zh-cn': 'Упрощенный китайский',
        'zh-tw': 'традиционный китайский'
    },
    sysInfo: {
        description: 'Деревянная основа на основе нейтральной разработки на основе VUE3 и Naiveui'
    },
    validateButton: {
        unableValidate: 'Номер мобильного телефона пустой или не соответствует правилам',
        getValidateCode: 'Получить код подтверждения'
    },
    tagObj: {
        closeAll: 'Закрыть все этикетки',
        closeCur: 'Закройте текущий ярлык',
        closeOther: 'Закройте другие этикетки',
        closeRight: 'Закрыть правильный ярлык',
        singlePage: 'Автономная страница',
        refreshPage: 'Обновить страницу',
        affixPage: 'Исправлена ​​страница',
        cancelAffixPage: 'Отменить фиксацию',
        errorTip: {
            homePageCloseError: 'Дом не допускается закрыть',
            affixPageCloseError: 'Фиксированная страница не разрешена закрывать',
            homePageAffixError: 'Дом не может быть отменен'
        },
        checkSave: 'Вы закрываете страницу? (Пожалуйста, убедитесь, что контент страницы красных меток был сохранен)',
        cancelClose: 'Закрытая операция'
    },
    modalObj: {
        tip: 'намекать',
        warn: 'предупреждать',
        confirm: 'подтверждать',
        yes: 'Да',
        no: 'нет'
    },
    userPanel: {
        frontendLog: 'Фронт-концевой журнал',
        customSetting: 'Персонализированная настройка',
        cleanConfig: 'Очистить конфигурацию',
        cleanCache: 'очистить кэш'
    },
    searchPanel: {
        expandText: 'Развернуться',
        collapseText: 'Убрать',
        resetText: 'Перезагрузить',
        searchText: 'Запрашивать'
    },
    comTip: {
        notFoundModule: 'Не могу найти модуль:'
    },
    logLine: {
        timeArea: 'лимит времени',
        tableTitle: 'Список журналов',
        tableColumn: {
            index: 'Серийный номер',
            desc: 'Описание журнала',
            type: 'Тип журнала',
            time: 'время',
            op: 'действовать'
        },
        extra: {
            view: 'Проверять',
            logDetail: 'логирование',
            logLevel: 'Уровень журнала',
            logType: 'Тип журнала',
            logDesc: 'Описание журнала',
            requestDetail: 'Детали запроса',
            clearLog: 'Пустой журнал',
            clearLogSuccess: 'Успешный'
        }
    },
    logTimeList: {
        halfDay: 'Пол дня',
        fullDay: 'В течение одного дня',
        weekDay: 'в течение недели',
        monthDay: 'В течении месяца'
    },
    comTable: {
        allPick: 'выбрать все'
    },
    errorPage: {
        errorTip: {
            notFoundTip: 'Извините, страница, которую вы посетили, не существует.',
            notRightTip: 'Извините, у вас нет разрешения на доступ к этой странице.',
            noServiceTip: 'Извините, у сервера есть проблема, пожалуйста, попробуйте позже позже'
        },
        btnText: 'Закрыть страницу'
    },
    guide: {
        pageComponent: {
            currentCp: 'Текущий компонент',
            tableTitle: 'Страница',
            paramKey: 'Ключ параметра',
            paramValue: 'Значение параметра',
            tip: 'Параметр компонента страницы может быть выполнен параметром параметра параметра компонентного объекта.',
            checkSave: '<Boolean> `Checksave` указывает, бросать ли подсказку, когда он закрыт',
            apiNew: '<Boolean> `Apinew` Указывает, проверять ли страницу',
            isAffix: '<Boolean> `ISaffix` Указывает, исправлена ​​ли текущая страница',
            pageUrl: '<String> `PageURL` Указывает внешний адрес цепи компонента страницы',
            pageApi: 'Страница операция API.',
            addPage: 'Новая страница',
            refreshPage: 'Обновить страницу',
            closePage: 'Закрыть страницу',
            state: 'штат',
            func: 'метод',
            example: 'пример',
            description: 'описывать',
            exampleCode: 'Образец кода'
        },
        i18nInternational: {
            supportLang: {
                tip: 'Текущий язык поддержки'
            }
        },
        applicationConfig: {
            applicationConfig: 'Конфигурация приложения',
            pageConfig: 'Конфигурация SPA',
            contextDir: 'Если пакет должен увеличить вторичный каталог имени приложения, вы можете изменить переменные двух файлов в Build / config.js и src / custom / atacets / ts / config.ts.',
            pageConfigDesc: 'Содержание в Page.config.json будет отображаться на Public / basic.html. В настоящее время поддерживаемый тип имеет CSS. JS может быть загружен таким образом для некоторых более крупных сторонних библиотек, таких как вавилон.'
        }
    }
}
