export default {
    locale: 'uk',
    country: 'UA',
    loginPanel: {
        validateTip: 'Код підтвердження',
        accountLogin: 'Вхід облікового запису Вхід',
        phoneLogin: 'Номер мобільного телефону Вхід',
        accountPhd: 'Введіть номер / обліковий запис',
        passwordPhd: 'Введіть пароль',
        validateCodePhd: 'Введіть код підтвердження',
        loginBtn: 'Увійти',
        autoLogin: 'Автоматичний вхід',
        forgetPwd: 'Забули пароль',
        accountReq: 'Номер / обліковий запис мобільного телефону не може бути порожнім',
        passwordReq: 'Пароль не може бути порожнім',
        validateCodeReq: 'Код перевірки повинен бути заповнений'
    },
    menuObj: {
        homePage: 'титульна сторінка',
        'menu-0': 'Основні функції',
        'menu-1': 'Використання компонентів',
        'menu-0-0': 'Технічний відбір',
        'menu-0-0-0': 'Vue3.x',
        'menu-0-0-1': 'Навіс',
        'menu-0-0-2': 'Піна',
        'menu-0-0-3': 'Біля адміністратора',
        'menu-1-0': 'Вбудований компонент',
        'menu-1-0-0': 'Панель пошуку',
        'menu-1-0-1': 'Загальна форма',
        'menu-0-1': 'Функція кадру',
        'menu-0-1-0': 'Компонент сторінки',
        'menu-0-1-0-0': 'Компонентна сторінка',
        'menu-0-1-0-1': 'Сторінка URL',
        'menu-0-1-1': 'Вбудована функція',
        'menu-0-1-1-0': 'Конфігурація проекту',
        'menu-0-1-1-1': 'глобалізація'
    },
    localeMap: {
        ar: 'Арабський',
        bg: 'Болгарський',
        ca: 'Каталонія',
        cs: 'Чеська',
        da: 'Данська мова',
        de: 'Німецький',
        el: 'Грецький',
        'en-gb': 'Англійська мова',
        en: 'Англійська мова',
        es: 'Іспанський',
        et: 'Естонський',
        fa: 'Перський',
        fi: 'Фінський',
        fr: 'Французький',
        he: 'Іврит',
        hi: 'Гінді',
        hr: 'Хорватський',
        hu: 'Угорський',
        hy: 'Вірменський',
        id: 'Індонезійська мова',
        is: 'Ісландська мова',
        it: 'Італійський',
        ja: 'Японський',
        kn: 'Канада',
        ko: 'Корейський',
        'ku-iq': 'Центральний курд',
        lv: 'Центральний курд',
        mk: 'Македонський',
        'mn-mn': 'Монгольський',
        'ms-my': 'Малайський',
        nb: 'Норвезька мова',
        'ne-np': 'Непальський',
        'nl-be': 'Фланд',
        nl: 'Голландський',
        pl: 'Польський',
        'pt-br': 'Бразильський португальський',
        pt: 'Європа Португальська',
        ro: 'Румунський',
        ru: 'російська мова',
        sk: 'Словацький',
        sl: 'Словенський',
        sr: 'Сербський',
        sv: 'Шведська мова',
        ta: 'Таміл',
        th: 'Тайський',
        tr: 'Турецький',
        uk: 'Український',
        vi: 'В\'єтнамський',
        'zh-cn': 'Спрощена Китайська',
        'zh-tw': 'традиційна китайська'
    },
    sysInfo: {
        description: 'Рамка нейтрального розвитку деревини на основі Vue3 і Naivui'
    },
    validateButton: {
        unableValidate: 'Номер мобільного телефону порожній або не відповідає правилам',
        getValidateCode: 'Отримати код підтвердження'
    },
    tagObj: {
        closeAll: 'Закрити всі мітки',
        closeCur: 'Закрийте поточну етикетку',
        closeOther: 'Закрити інші етикетки',
        closeRight: 'Закрийте правильну етикетку',
        singlePage: 'Автономна сторінка',
        refreshPage: 'Оновити сторінку',
        affixPage: 'Фіксована сторінка',
        cancelAffixPage: 'Скасувати фіксацію',
        errorTip: {
            homePageCloseError: 'Будинок не може закрити',
            affixPageCloseError: 'Фіксована сторінка не може закритися',
            homePageAffixError: 'Додому не можна скасувати'
        },
        checkSave: 'Ви закриваєте сторінку? (Будь ласка, переконайтеся, що вміст сторінки Red Label був збережений)',
        cancelClose: 'Закрита операція'
    },
    modalObj: {
        tip: 'натяк',
        warn: 'попередити',
        confirm: 'підтверджувати',
        yes: 'Так',
        no: 'ні'
    },
    userPanel: {
        frontendLog: 'Фронтальний журнал',
        customSetting: 'Персоналізований обстановка',
        cleanConfig: 'Очистити конфігурацію',
        cleanCache: 'очистити кеш'
    },
    searchPanel: {
        expandText: 'Розгортати',
        collapseText: 'Прибирати',
        resetText: 'Скидання',
        searchText: 'Запитувати'
    },
    comTip: {
        notFoundModule: 'Не вдається знайти модуль:'
    },
    logLine: {
        timeArea: 'термін',
        tableTitle: 'Список журналів',
        tableColumn: {
            index: 'Серійний номер',
            desc: 'Опис журналу',
            type: 'Тип журналу',
            time: 'час',
            op: 'працювати'
        }
    },
    logTimeList: {
        halfDay: 'Півдня',
        fullDay: 'за один день',
        weekDay: 'протягом тижня',
        monthDay: 'Протягом місяця'
    }
}
